merge 하려는 키가 DataFrame의 색인일 수 있다. 이때에는 `left_merge=True` 혹은 `right_merge=True` 옵션을 지정해 해당 색인을 merge 키로 사용할 수 있다.

In [15]:
import numpy as np
import pandas as pd

In [16]:
left1 = pd.DataFrame({'key':['a','b','a','a','b','c'],
                     'value':range(6)})

In [17]:
right1 = pd.DataFrame({'group_val':[3.5, 7],
                     'index':['a','b']})

In [18]:
left1

  key  value
0   a      0
1   b      1
2   a      2
3   a      3
4   b      4
5   c      5

In [22]:
right1 = right1.set_index('index')

In [23]:
right1

       group_val
index
a            3.5
b            7.0

In [28]:
pd.merge(left1, right1, left_on='key', right_index=True)

  key  value  group_val
0   a      0        3.5
2   a      2        3.5
3   a      3        3.5
1   b      1        7.0
4   b      4        7.0

색인으로 merge 할 때 DataFrame의 join 메서드를 사용하면 편리하다.<br/>
join 메서드는 컬럼이 겹치지 않으며 완전히 같거나 유사한 색인 구조를 가진 여러 개의 DataFrame 객체를 병합할 때 사용할 수 있다.<br/>

In [29]:
left2 = pd.DataFrame([[1.,2], [3.,4], [5.,6]],
                    index=['a','c','e'],
                    columns=['Ohio','Nevada'])

In [31]:
right2 = pd.DataFrame([[7.,8], [9.,10], [11.,12], [13.,14]],
                    index=['b','c','d','e'],
                    columns=['Missouri','Alabama'])

In [32]:
left2

   Ohio  Nevada
a   1.0       2
c   3.0       4
e   5.0       6

In [33]:
right2

   Missouri  Alabama
b       7.0        8
c       9.0       10
d      11.0       12
e      13.0       14

In [34]:
left2.join(right2)

   Ohio  Nevada  Missouri  Alabama
a   1.0       2       NaN      NaN
c   3.0       4       9.0     10.0
e   5.0       6      13.0     14.0

In [36]:
left2.join(right2, how='outer')

   Ohio  Nevada  Missouri  Alabama
a   1.0     2.0       NaN      NaN
b   NaN     NaN       7.0      8.0
c   3.0     4.0       9.0     10.0
d   NaN     NaN      11.0     12.0
e   5.0     6.0      13.0     14.0

In [40]:
left1

  key  value
0   a      0
1   b      1
2   a      2
3   a      3
4   b      4
5   c      5

In [41]:
right1

       group_val
index
a            3.5
b            7.0

In [37]:
left1.join(right1)

  key  value  group_val
0   a      0        NaN
1   b      1        NaN
2   a      2        NaN
3   a      3        NaN
4   b      4        NaN
5   c      5        NaN

In [39]:
left1.join(right1, on='key')

  key  value  group_val
0   a      0        3.5
1   b      1        7.0
2   a      2        3.5
3   a      3        3.5
4   b      4        7.0
5   c      5        NaN

색인 대 색인으로 두 DataFrame을 합치려면 그냥 간단히 merge하려는 DataFrame의 리스트를 join메서드에 넘기면 된다.<br/> 하지만 일반적으로 이런 merge는 다음의 `concat`을 사용한다.

In [45]:
another = pd.DataFrame([[7.,8.], [9.,10.], [11.,12.], [16., 17.]],
                      index=['a','c','e','f'],
                      columns=['서울','제주'])

In [46]:
another

     서울    제주
a   7.0   8.0
c   9.0  10.0
e  11.0  12.0
f  16.0  17.0

In [48]:
left2.join(right2)

   Ohio  Nevada  Missouri  Alabama
a   1.0       2       NaN      NaN
c   3.0       4       9.0     10.0
e   5.0       6      13.0     14.0

In [47]:
left2.join([right2,another])

   Ohio  Nevada  Missouri  Alabama    서울    제주
a   1.0       2       NaN      NaN   7.0   8.0
c   3.0       4       9.0     10.0   9.0  10.0
e   5.0       6      13.0     14.0  11.0  12.0

In [49]:
left2.join([right2,another],how='outer')

   Ohio  Nevada  Missouri  Alabama    서울    제주
a   1.0     2.0       NaN      NaN   7.0   8.0
b   NaN     NaN       7.0      8.0   NaN   NaN
c   3.0     4.0       9.0     10.0   9.0  10.0
d   NaN     NaN      11.0     12.0   NaN   NaN
e   5.0     6.0      13.0     14.0  11.0  12.0
f   NaN     NaN       NaN      NaN  16.0  17.0